Podkova/src/InformationRegisters/ПулКодовМаркировкиСУЗ/ПулКодовМаркировкиСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПулКодовМаркировкиСУЗ</name>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыКодовМаркировкиСУЗ</types>
    </type>
  </resources>
  <attributes>
    <name>Организация</name>
    <type>
      <types>DefinedType.Организация</types>
    </type>
  </attributes>
  <attributes>
    <name>СтанцияУправленияЗаказами</name>
    <type>
      <types>CatalogRef.СтанцииУправленияЗаказамиИСМП</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>DefinedType.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Характеристика</name>
    <type>
      <types>DefinedType.ХарактеристикаНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолныйКодМаркировки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЭмиссииУниверсальная</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПечатиУниверсальная</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ШтрихкодУпаковки</name>
    <type>
      <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>GTIN</name>
    <type>
      <types>DefinedType.GTIN</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПродукции</name>
    <type>
      <types>EnumRef.ВидыПродукцииИС</types>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальнаяРозничнаяЦена</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаГосИСНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособВводаВОборот</name>
    <type>
      <types>EnumRef.СпособыВводаВОборотСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>EnumRef.ШаблоныКодовМаркировкиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ХешСуммаУпаковки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипШтрихкода</name>
    <type>
      <types>EnumRef.ТипыШтрихкодов</types>
    </type>
  </attributes>
  <attributes>
    <name>МаркировкаОстатков</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокГодности</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторЗаказаСУЗ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторБлокаСУЗ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ДокументОснование</name>
    <type>
      <types>DefinedType.ОснованиеЗаказНаЭмиссиюКодовМаркировкиИСМП</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаказНаЭмиссию</name>
    <type>
      <types>DocumentRef.ЗаказНаЭмиссиюКодовМаркировкиСУЗ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КодМаркировки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ХешСуммаКодаМаркировки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Podkova/src/Documents/ЗаказНаЭмиссиюКодовМаркировкиСУЗ/ЗаказНаЭмиссиюКодовМаркировкиСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказНаЭмиссиюКодовМаркировкиСУЗ</name>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DefinedType.ОснованиеЗаказНаЭмиссиюКодовМаркировкиИСМП</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>DefinedType.Организация</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПродукции</name>
    <type>
      <types>EnumRef.ВидыПродукцииИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПроизводственногоЗаказа</name>
    <type>
      <types>DefinedType.УникальныйИдентификаторИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПроизводственнойЛинии</name>
    <type>
      <types>DefinedType.УникальныйИдентификаторИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводственныйОбъект</name>
    <type>
      <types>DefinedType.ПроизводственныйОбъектИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводственныйОбъектИдентификатор</name>
    <type>
      <types>DefinedType.УникальныйИдентификаторИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводственныйОбъектАдрес</name>
    <comment>Внутренние значения полей адреса доставки (контактная информация)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводственныйОбъектАдресСтрокой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособВводаВОборот</name>
    <type>
      <types>EnumRef.СпособыВводаВОборотСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ОжидаемаяДатаНачалаПроизводства</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>DefinedType.ПользователиИС</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>DefinedType.КонтрагентГосИС</types>
    </type>
  </attributes>
  <attributes>
    <name>БезУчетаНоменклатуры</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВвезенПослеДатыОбязательнойМаркировки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриобретенПроизведенПослеДатыОбязательнойМаркировки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СервисПровайдер</name>
    <type>
      <types>CatalogRef.СервисПровайдерыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторЗаявки</name>
    <type>
      <types>DefinedType.ИдентификаторЗаявкиИСМП</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьНомерДоговораСОператором</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьДатаДоговораСОператором</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьВидСредстваИдентификации</name>
    <type>
      <types>EnumRef.УдалитьВидыСредствИдентификацииСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьВидМаркировки</name>
    <type>
      <types>EnumRef.УдалитьВидыМаркировкиСУЗ</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СерийныеНомера</name>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>DefinedType.УникальныйИдентификаторИС</types>
      </type>
    </attributes>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>DefinedType.УникальныйИдентификаторИС</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>DefinedType.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>DefinedType.ХарактеристикаНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>DefinedType.Упаковка</types>
      </type>
    </attributes>
    <attributes>
      <name>GTIN</name>
      <type>
        <types>DefinedType.GTIN</types>
      </type>
    </attributes>
    <attributes>
      <name>Код</name>
      <comment>Код товара в ИС МП</comment>
      <type>
        <types>DefinedType.УникальныйИдентификаторИС</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Шаблон</name>
      <type>
        <types>EnumRef.ШаблоныКодовМаркировкиСУЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>МаксимальнаяРозничнаяЦена</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаГосИСНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СпособФормированияСерийногоНомера</name>
      <type>
        <types>EnumRef.СпособыФормированияСерийногоНомераСУЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусУказанияСерии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодТНВЭД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦелевойПол</name>
      <type>
        <types>EnumRef.ЦелевойПолИСМП</types>
      </type>
    </attributes>
    <attributes>
      <name>СпособВводаВОборот</name>
      <type>
        <types>EnumRef.СпособыВводаВОборотСУЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>Модель</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТоварныйЗнак</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВозрастнаяКатегория</name>
      <type>
        <types>EnumRef.ВозрастныеКатегорииИСМП</types>
      </type>
    </attributes>
    <attributes>
      <name>СрокГодности</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ШаблонЭтикетки</name>
      <type>
        <types>CatalogRef.ШаблоныЭтикетокСУЗ</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Podkova/src/InformationRegisters/ПулКодовМаркировкиСУЗ/Forms/ФормаРезервирования/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
		
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	ОбработатьИПроверитьПереданныеПараметры(Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьДанныеФормы();
	
	ИспользоватьХарактеристикиНоменклатуры = ИнтеграцияИС.ХарактеристикиИспользуются();
	
	УправлениеЭлементамиФормыПриСоздании();
	
	СобытияФормИСПереопределяемый.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Обновить(Команда)
	
	ЗаполнитьДанныеФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("Документ", Документ);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПриВыполненииКоманды", ЭтотОбъект, Команда);
	
	ОткрытьФорму("РегистрСведений.ПулКодовМаркировкиСУЗ.Форма.ФормаПечати",
		ПараметрыФормы, ЭтотОбъект,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ВиртуальнаяАгрегация(Команда)
	
	ТекущиеДанные = Элементы.ПулКодовМаркировки.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Если ПулКодовМаркировки.Количество() > 0 Тогда
			ТекущиеДанные = ПулКодовМаркировки[0];
		Иначе
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("Документ", Документ);
	ПараметрыФормы.Вставить("ВидПродукции", ТекущиеДанные.ВидПродукции);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПриВыполненииКоманды", ЭтотОбъект, Команда);
	
	ОткрытьФорму("Обработка.ВиртуальнаяАгрегацияУпаковокИСМП.Форма",
		ПараметрыФормы, ЭтотОбъект,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗарезервироватьИЗаказать(Команда)
	
	ДлительнаяОперация = НачатьРезервированиеКодов();
	ОповещениеОЗавершении = Новый ОписаниеОповещения("РезервированиеКодовЗавершение", ЭтотОбъект);
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ТекстСообщения = НСтр("ru = 'Резервирование кодов маркировки.'");
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление();
	
	УсловноеОформление.Элементы.Очистить();
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьИПроверитьПереданныеПараметры(Отказ)
	
	Если Не ЗначениеЗаполнено(Параметры.Документ) Тогда
		ТекстОшибки = НСтр("ru = 'В форму заказа и резервирования кодов маркировки не передан документ.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,,,,Отказ);
		Возврат;
	КонецЕсли;
	
	Если НЕ Метаданные.ОпределяемыеТипы.ОснованиеЗаказНаЭмиссиюКодовМаркировкиИСМП.Тип.СодержитТип(ТипЗнч(Параметры.Документ)) Тогда
		ТекстОшибки = НСтр("ru = 'В форму заказа и резервирования кодов маркировки передан документ неправильного типа.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,,,,Отказ);
		Возврат;
	КонецЕсли;
		
	Документ = Параметры.Документ;
	
КонецПроцедуры

&НаСервере
Процедура УправлениеЭлементамиФормыПриСоздании()
	
	Если НЕ ИспользоватьХарактеристикиНоменклатуры Тогда
		Элементы.ПулКодовМаркировкиХарактеристика.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеФормы()
	
	ДанныеПоДокументу = РегистрыСведений.ПулКодовМаркировкиСУЗ.РассчитатьТаблицуСостоянияПоЗаказу(Документ);
	ПулКодовМаркировки.Загрузить(ДанныеПоДокументу);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриВыполненииКоманды(Результат, ДополнительныеПараметры) Экспорт
	
	ЗаполнитьДанныеФормы();
	
КонецПроцедуры

#Область РезервированиеИЗаказКодовМаркировки

&НаСервере
Функция НачатьРезервированиеКодов()
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("Документ", Документ);
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(ЭтотОбъект.УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Резервирование кодов маркировки в пуле кодов СУЗ.'");
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
	
	ИнтеграцияИСПереопределяемый.НастроитьДлительнуюОперацию(ПараметрыПроцедуры, ПараметрыВыполнения);
	
	Возврат ДлительныеОперации.ВыполнитьВФоне("РегистрыСведений.ПулКодовМаркировкиСУЗ.ЗарезервироватьКодыПодЗаказ",
		ПараметрыПроцедуры, ПараметрыВыполнения);
	
КонецФункции

&НаКлиенте
Процедура РезервированиеКодовЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда  // отменено пользователем
		Закрыть();
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		ПоказатьПредупреждение(, Результат.КраткоеПредставлениеОшибки);
	ИначеЕсли Результат.Статус = "Выполнено" Тогда
		РезервированиеКодовЗавершениеНаСервере(Результат.АдресРезультата);
		ЗаказатьКодыМаркировки();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура РезервированиеКодовЗавершениеНаСервере(АдресРезультата)
	
	Если ЭтоАдресВременногоХранилища(АдресРезультата) Тогда
		РезультатРезервирования = ПолучитьИзВременногоХранилища(АдресРезультата);
		Если ТипЗнч(РезультатРезервирования) = Тип("Структура")
			И РезультатРезервирования.Свойство("ТаблицаСостояниеКодов")
			И ТипЗнч(РезультатРезервирования.ТаблицаСостояниеКодов) = Тип("ТаблицаЗначений") Тогда
			
			ТаблицаДоРезервирования = ПулКодовМаркировки.Выгрузить();
			ТаблицаДоРезервирования.Индексы.Добавить("Номенклатура,Характеристика");
			ПулКодовМаркировки.Загрузить(РезультатРезервирования.ТаблицаСостояниеКодов);
			
			Для Каждого СтрокаТаблицы Из ПулКодовМаркировки Цикл
				
				СтрокаТаблицы.КоличествоЗаказать = 0;
				
				СтруктураПоиска = Новый Структура();
				СтруктураПоиска.Вставить("Номенклатура",   СтрокаТаблицы.Номенклатура);
				СтруктураПоиска.Вставить("Характеристика", СтрокаТаблицы.Характеристика);
					
				Для Каждого СтрокаДоРезервирования Из ТаблицаДоРезервирования.НайтиСтроки(СтруктураПоиска) Цикл
					
					Если СтрокаДоРезервирования.КоличествоЗаказать <= 0 Тогда
						Продолжить;
					КонецЕсли;
					
					Зарезервировано = СтрокаТаблицы.КоличествоПечатать - СтрокаДоРезервирования.КоличествоПечатать;
					СтрокаТаблицы.КоличествоЗаказать = СтрокаДоРезервирования.КоличествоЗаказать - Зарезервировано;
					
				КонецЦикла;
			
			КонецЦикла;
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
	
&НаКлиенте
Процедура ЗаказатьКодыМаркировки()
	
	ВидыПродукции = Новый Соответствие();
	
	Для Каждого СтрокаТЧ Из ПулКодовМаркировки Цикл
		Если СтрокаТЧ.КоличествоЗаказать > 0 Тогда
			ДанныеСтроки = Новый Структура("Номенклатура,Характеристика,Количество,КоличествоУпаковок");
			ЗаполнитьЗначенияСвойств(ДанныеСтроки, СтрокаТЧ);
			ДанныеСтроки.Количество = СтрокаТЧ.КоличествоЗаказать;
			ДанныеСтроки.КоличествоУпаковок = СтрокаТЧ.КоличествоЗаказать;
			
			Товары = ВидыПродукции[СтрокаТЧ.ВидПродукции];
			
			Если Товары = Неопределено Тогда
				Товары = Новый Массив();
			КонецЕсли;
			
			Товары.Добавить(ДанныеСтроки);
			ВидыПродукции.Вставить(СтрокаТЧ.ВидПродукции, Товары);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого КлючИЗначение Из ВидыПродукции Цикл
		ДанныеЗаполнения = Новый Структура;
		ДанныеЗаполнения.Вставить("ДанныеПула");
		ДанныеЗаполнения.Вставить("ВидПродукции", КлючИЗначение.Ключ);
		ДанныеЗаполнения.Вставить("ДокументОснование", Документ);
		ДанныеЗаполнения.Вставить("Товары", КлючИЗначение.Значение);
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ПриВыполненииКоманды", ЭтотОбъект, Команды.ЗарезервироватьИЗаказать);
		
		ИнтеграцияИСМПКлиент.ОткрытьФормуСозданияДокумента(
			"Документ.ЗаказНаЭмиссиюКодовМаркировкиСУЗ",
			ДанныеЗаполнения,
			ЭтотОбъект,
			ОписаниеОповещения);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
